//NCS코드 대분류코드 번호를 통한 중분류코드 분류
function changeNcs1() {
	var $ncsCd1 = $("#ncsCd1");
	var $ncsCd2 = $("#ncsCd2");
	var $ncsCd3 = $("#ncsCd3");
	var ncs12Data = {
		"19" : [{"1901":"전기(1901)"},{"1902":"전자기기일반(1902)"},{"1903":"전자기기개발(1903)"}],
		"20" : [{"2001":"정보기술(2001)"},{"2002":"통신기술(2002)"},{"2003":"방송기술(2003)"}],
		"21" : [{"2101":"식품가공(2101)"},{"2102":"제과·제빵·떡제조(2102)"}]
	}

	$ncsCd2.empty();
	$ncsCd2.append("<option value=''>전체</option>");
	$ncsCd3.empty();
	$ncsCd3.append("<option value=''>전체</option>");

	$.each(ncs12Data[$ncsCd1.val()], function(index, el){
		$.each(el, function(key, val){
			$ncsCd2.append("<option value=" + key + ">" + val + "</option>");
	    });
	});
}

//NCS코드 중분류코드 번호를  통한 소분류코드 분류
function changeNcs2() {
	var $ncsCd2 = $("#ncsCd2");
	var $ncsCd3 = $("#ncsCd3");
	var ncs23Data = {
		"2001" : [{"200101":"정보기술전략·계획(200101)"},{"200102":"정보기술개발(200102)"},{"200103":"정보기술운영(200103)"},{"200104":"정보기술관리(200104)"},{"200105":"정보기술영업(200105)"},{"200106":"정보보호(200106)"}],
		"2002" : [{"200201":"유선통신구축(200201)"},{"200202":"무선통신구축(이동통신 포함)(200202)"},{"200203":"통신서비스(200203)"},{"200204":"실감형콘텐츠제작(200204)"}],
		"2003" : [{"200301":"방송제작기술(200301)"},{"200302":"방송플랫폼기술(200302)"},{"200303":"방송서비스(200303)"}]
	}

	$ncsCd3.empty();
	$ncsCd3.append("<option value=''>전체</option>");


	$.each(ncs23Data[$ncsCd2.val()], function(index, el){
		$.each(el, function(key, val){
			$ncsCd3.append("<option value=" + key + ">" + val + "</option>");
	    });
	});	
}

// 시/도 를통한 시/군/구 분류 
function changeArea() {
	var $area1 = $("#area1");
	var $area2 = $("#area2");
	var areaData={
		"서울" : ["강남구","강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구","용산구","은평구","종로구","중구","중랑구"],
		"인천" : ["강화군","계양구","남구","남동구","동구","부평구","서구","연수구","옹진군","중구"],
		"경기" : ["가평군","고양시","고양시 덕양구","고양시 일산동구","고양시 일산서구","과천시","광명시","광주시","구리시","군포시","김포시","남양주시","동두천시","부천시","성남시","성남시 분당구","성남시 수정구","성남시 중원구","수원시","수원시 권선구","수원시 영통구","수원시 장안구","수원시 팔달구","시흥시","안산시","안산시 단원구","안산시 상록구","안성시","안양시","안양시 동안구","안양시 만안구","양주군","양주시","양평군","여주군","여주시","연천군","오산시","용인시","용인시 기흥기","용인시 수지구","용인시 처인구","의왕시","의정부시","이천시","파주시","평택시","포천군","포천시","하남시","화성시"]
	}
	
	$area2.empty();
	$area2.append("<option value=''>시군구</option>");
	
	$.each(areaData[$area1.val()], function(index, val){
		$area2.append("<option>" + val + "</option>");
	});	
}